---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ReferenceOtherViewUiToggle
source: html/86f8bc8c-b1ec-5540-1941-eab965832488.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ReferenceOtherViewUiToggle Property

"Reference Other View": This is used to determine whether reference other view is enable or not.

## Syntax (C#)
```csharp
public static ForgeTypeId ReferenceOtherViewUiToggle { get; }
```